espressif/esp-idf/components/soc/esp32c6/include/soc/host_struct.h
/** Type of conf_w9 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf36 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf36:8;
        /** slchost_conf37 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf37:8;
        /** slchost_conf38 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf38:8;
        /** slchost_conf39 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf39:8;
    };
    uint32_t val;
} slchost_conf_w9_reg_t;

/** Type of conf_w10 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf40 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf40:8;
        /** slchost_conf41 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf41:8;
        /** slchost_conf42 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf42:8;
        /** slchost_conf43 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf43:8;
    };
    uint32_t val;
} slchost_conf_w10_reg_t;

/** Type of conf_w11 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf44 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf44:8;
        /** slchost_conf45 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf45:8;
        /** slchost_conf46 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf46:8;
        /** slchost_conf47 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf47:8;
    };
    uint32_t val;
} slchost_conf_w11_reg_t;

/** Type of conf_w12 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf48 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf48:8;
        /** slchost_conf49 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf49:8;
        /** slchost_conf50 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf50:8;
        /** slchost_conf51 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf51:8;
    };
    uint32_t val;
} slchost_conf_w12_reg_t;

/** Type of conf_w13 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf52 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf52:8;
        /** slchost_conf53 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf53:8;
        /** slchost_conf54 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf54:8;
        /** slchost_conf55 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf55:8;
    };
    uint32_t val;
} slchost_conf_w13_reg_t;

/** Type of conf_w14 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf56 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf56:8;
        /** slchost_conf57 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf57:8;
        /** slchost_conf58 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf58:8;
        /** slchost_conf59 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf59:8;
    };
    uint32_t val;
} slchost_conf_w14_reg_t;

/** Type of conf_w15 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf60 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf60:8;
        /** slchost_conf61 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf61:8;
        /** slchost_conf62 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf62:8;
        /** slchost_conf63 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf63:8;
    };
    uint32_t val;
} slchost_conf_w15_reg_t;

/** Type of check_sum0 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_check_sum0 : RO; bitpos: [31:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_check_sum0:32;
    };
    uint32_t val;
} slchost_check_sum0_reg_t;

/** Type of check_sum1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_check_sum1 : RO; bitpos: [31:0]; default: 319;
         *  *******Description***********
         */
        uint32_t slchost_check_sum1:32;
    };
    uint32_t val;
} slchost_check_sum1_reg_t;

/** Type of slc1host_token_rdata register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc1_token0 : RO; bitpos: [11:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token0:12;
        /** slc1_rx_pf_valid : RO; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_rx_pf_valid:1;
        uint32_t reserved_13:3;
        /** hostslchost_slc1_token1 : RO; bitpos: [27:16]; default: 0;
         *  *******Description***********
         */
        uint32_t hostslchost_slc1_token1:12;
        /** slc1_rx_pf_eof : RO; bitpos: [31:28]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_rx_pf_eof:4;
    };
    uint32_t val;
} slchost_slc1host_token_rdata_reg_t;

/** Type of slc0host_token_wdata register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc0host_token0_wd : R/W; bitpos: [11:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_token0_wd:12;
        uint32_t reserved_12:4;
        /** slc0host_token1_wd : R/W; bitpos: [27:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_token1_wd:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} slchost_slc0host_token_wdata_reg_t;

/** Type of slc1host_token_wdata register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc1host_token0_wd : R/W; bitpos: [11:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_token0_wd:12;
        uint32_t reserved_12:4;
        /** slc1host_token1_wd : R/W; bitpos: [27:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_token1_wd:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} slchost_slc1host_token_wdata_reg_t;

/** Type of token_con register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc0host_token0_dec : WT; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_token0_dec:1;
        /** slc0host_token1_dec : WT; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_token1_dec:1;
        /** slc0host_token0_wr : WT; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_token0_wr:1;
        /** slc0host_token1_wr : WT; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_token1_wr:1;
        /** slc1host_token0_dec : WT; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_token0_dec:1;
        /** slc1host_token1_dec : WT; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_token1_dec:1;
        /** slc1host_token0_wr : WT; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_token0_wr:1;
        /** slc1host_token1_wr : WT; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_token1_wr:1;
        /** slc0host_len_wr : WT; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_len_wr:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} slchost_token_con_reg_t;

/** Type of slc0host_int_clr register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc0_tohost_bit0_int_clr : WT; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit0_int_clr:1;
        /** slc0_tohost_bit1_int_clr : WT; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit1_int_clr:1;
        /** slc0_tohost_bit2_int_clr : WT; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit2_int_clr:1;
        /** slc0_tohost_bit3_int_clr : WT; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit3_int_clr:1;
        /** slc0_tohost_bit4_int_clr : WT; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit4_int_clr:1;
        /** slc0_tohost_bit5_int_clr : WT; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit5_int_clr:1;
        /** slc0_tohost_bit6_int_clr : WT; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit6_int_clr:1;
        /** slc0_tohost_bit7_int_clr : WT; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit7_int_clr:1;
        /** slc0_token0_1to0_int_clr : WT; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token0_1to0_int_clr:1;
        /** slc0_token1_1to0_int_clr : WT; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token1_1to0_int_clr:1;
        /** slc0_token0_0to1_int_clr : WT; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token0_0to1_int_clr:1;
        /** slc0_token1_0to1_int_clr : WT; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token1_0to1_int_clr:1;
        /** slc0host_rx_sof_int_clr : WT; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_sof_int_clr:1;
        /** slc0host_rx_eof_int_clr : WT; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_eof_int_clr:1;
        /** slc0host_rx_start_int_clr : WT; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_start_int_clr:1;
        /** slc0host_tx_start_int_clr : WT; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_tx_start_int_clr:1;
        /** slc0_rx_udf_int_clr : WT; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_udf_int_clr:1;
        /** slc0_tx_ovf_int_clr : WT; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tx_ovf_int_clr:1;
        /** slc0_rx_pf_valid_int_clr : WT; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_pf_valid_int_clr:1;
        /** slc0_ext_bit0_int_clr : WT; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit0_int_clr:1;
        /** slc0_ext_bit1_int_clr : WT; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit1_int_clr:1;
        /** slc0_ext_bit2_int_clr : WT; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit2_int_clr:1;
        /** slc0_ext_bit3_int_clr : WT; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit3_int_clr:1;
        /** slc0_rx_new_packet_int_clr : WT; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_new_packet_int_clr:1;
        /** slc0_host_rd_retry_int_clr : WT; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_host_rd_retry_int_clr:1;
        /** gpio_sdio_int_clr : WT; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t gpio_sdio_int_clr:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} slchost_slc0host_int_clr_reg_t;

/** Type of slc1host_int_clr register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc1_tohost_bit0_int_clr : WT; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit0_int_clr:1;
        /** slc1_tohost_bit1_int_clr : WT; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit1_int_clr:1;
        /** slc1_tohost_bit2_int_clr : WT; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit2_int_clr:1;
        /** slc1_tohost_bit3_int_clr : WT; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit3_int_clr:1;
        /** slc1_tohost_bit4_int_clr : WT; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit4_int_clr:1;
        /** slc1_tohost_bit5_int_clr : WT; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit5_int_clr:1;
        /** slc1_tohost_bit6_int_clr : WT; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit6_int_clr:1;
        /** slc1_tohost_bit7_int_clr : WT; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit7_int_clr:1;
        /** slc1_token0_1to0_int_clr : WT; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token0_1to0_int_clr:1;
        /** slc1_token1_1to0_int_clr : WT; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token1_1to0_int_clr:1;
        /** slc1_token0_0to1_int_clr : WT; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token0_0to1_int_clr:1;
        /** slc1_token1_0to1_int_clr : WT; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token1_0to1_int_clr:1;
        /** slc1host_rx_sof_int_clr : WT; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_sof_int_clr:1;
        /** slc1host_rx_eof_int_clr : WT; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_eof_int_clr:1;
        /** slc1host_rx_start_int_clr : WT; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_start_int_clr:1;
        /** slc1host_tx_start_int_clr : WT; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_tx_start_int_clr:1;
        /** slc1_rx_udf_int_clr : WT; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_rx_udf_int_clr:1;
        /** slc1_tx_ovf_int_clr : WT; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tx_ovf_int_clr:1;
        /** slc1_rx_pf_valid_int_clr : WT; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_rx_pf_valid_int_clr:1;
        /** slc1_ext_bit0_int_clr : WT; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit0_int_clr:1;
        /** slc1_ext_bit1_int_clr : WT; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit1_int_clr:1;
        /** slc1_ext_bit2_int_clr : WT; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit2_int_clr:1;
        /** slc1_ext_bit3_int_clr : WT; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit3_int_clr:1;
        /** slc1_wifi_rx_new_packet_int_clr : WT; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_wifi_rx_new_packet_int_clr:1;
        /** slc1_host_rd_retry_int_clr : WT; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_host_rd_retry_int_clr:1;
        /** slc1_bt_rx_new_packet_int_clr : WT; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_bt_rx_new_packet_int_clr:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} slchost_slc1host_int_clr_reg_t;

/** Type of slc0host_func1_int_ena register
 *  *******Description***********
 */
typedef union {
    struct {
        /** fn1_slc0_tohost_bit0_int_ena : R/W; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_tohost_bit0_int_ena:1;
        /** fn1_slc0_tohost_bit1_int_ena : R/W; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_tohost_bit1_int_ena:1;
        /** fn1_slc0_tohost_bit2_int_ena : R/W; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_tohost_bit2_int_ena:1;
        /** fn1_slc0_tohost_bit3_int_ena : R/W; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_tohost_bit3_int_ena:1;
        /** fn1_slc0_tohost_bit4_int_ena : R/W; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_tohost_bit4_int_ena:1;
        /** fn1_slc0_tohost_bit5_int_ena : R/W; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_tohost_bit5_int_ena:1;
        /** fn1_slc0_tohost_bit6_int_ena : R/W; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_tohost_bit6_int_ena:1;
        /** fn1_slc0_tohost_bit7_int_ena : R/W; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_tohost_bit7_int_ena:1;
        /** fn1_slc0_token0_1to0_int_ena : R/W; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_token0_1to0_int_ena:1;
        /** fn1_slc0_token1_1to0_int_ena : R/W; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_token1_1to0_int_ena:1;
        /** fn1_slc0_token0_0to1_int_ena : R/W; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_token0_0to1_int_ena:1;
        /** fn1_slc0_token1_0to1_int_ena : R/W; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_token1_0to1_int_ena:1;
        /** fn1_slc0host_rx_sof_int_ena : R/W; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0host_rx_sof_int_ena:1;
        /** fn1_slc0host_rx_eof_int_ena : R/W; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0host_rx_eof_int_ena:1;
        /** fn1_slc0host_rx_start_int_ena : R/W; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0host_rx_start_int_ena:1;
        /** fn1_slc0host_tx_start_int_ena : R/W; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0host_tx_start_int_ena:1;
        /** fn1_slc0_rx_udf_int_ena : R/W; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_rx_udf_int_ena:1;
        /** fn1_slc0_tx_ovf_int_ena : R/W; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_tx_ovf_int_ena:1;
        /** fn1_slc0_rx_pf_valid_int_ena : R/W; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_rx_pf_valid_int_ena:1;
        /** fn1_slc0_ext_bit0_int_ena : R/W; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_ext_bit0_int_ena:1;
        /** fn1_slc0_ext_bit1_int_ena : R/W; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_ext_bit1_int_ena:1;
        /** fn1_slc0_ext_bit2_int_ena : R/W; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_ext_bit2_int_ena:1;
        /** fn1_slc0_ext_bit3_int_ena : R/W; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_ext_bit3_int_ena:1;
        /** fn1_slc0_rx_new_packet_int_ena : R/W; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_rx_new_packet_int_ena:1;
        /** fn1_slc0_host_rd_retry_int_ena : R/W; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc0_host_rd_retry_int_ena:1;
        /** fn1_gpio_sdio_int_ena : R/W; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_gpio_sdio_int_ena:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} slchost_slc0host_func1_int_ena_reg_t;

